# DTM6_ClearModelCache

## Description
Clear the site model's cache.

```pascal
PROCEDURE DTM6_ClearModelCache(hObject : HANDLE);
```

```python
def vs.DTM6_ClearModelCache(hObject):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|A handle to the Site Model object.|

## See Also
DTM6_GetDTMObject

## Version
Availability: from Vectorworks 2011

## Category
* SiteModel Interface Library